import random

from enemy import Enemy
from enemy_loot import EnemyLoot

new_random = random

# Оружие: Название, прочность, максимальная прочность, бронебойность, урон, очередь, точность, дальность, эргономика, тип патронов, количество патронов в магазине, размер магазина, штраф очереди
fullWeaponDict = {
    "Пистолет Зосимова": ["Пистолет Зосимова", 100, 100, "5%", 50, 1, 1, 6, 65, "Обычный", 8, 8, 4],
    "Револьвер Оцелот-5": ["Револьвер Оцелот-5", 100, 100, "5%", 50, 1, 1, 8, 75, "Обычный", 5, 5, 4],
    "Пистолет Крепость-12": ["Пистолет Крепость-12", 100, 100, "5%", 50, 2, 2, 7, 65, "Обычный", 12, 12, 4],
    "Пистолет Февраля": ["Пистолет Крепость-12", 100, 100, "15%", 60, 1, 3, 8, 60, "Обычный", 14, 14, 4],
    "Пистолет Вольер-66": ["Пистолет Вольер-66", 100, 100, "15%", 60, 1, 2, 10, 60, "Обычный", 16, 16, 4],
    "Пистолет Батальон": ["Пистолет Батальон", 100, 100, "25%", 65, 1, 2, 8, 75, "Обычный", 12, 12, 4],
    "Пистолет Двадцать-восемь": ["Пистолет Двадцать-восемь", 100, 100, "25%", 55, 1, 2, 10, 70, "Обычный", 20, 20, 4],
    "Пистолет ДД": ["Пистолет ДД", 100, 100, "15%", 75, 1, 0, 8, 50, "Обычный", 8, 8, 4],
    "Пистолет Альпинист": ["Пистолет Альпинист", 100, 100, "25%", 65, 1, 3, 12, 90, "Обычный", 7, 7, 4],
    "Револьвер Slon": ["Револьвер Slon", 100, 100, "20%", 80, 1, 2, 8, 50, "Обычный", 5, 5, 4],
    "Пистолет Горка-2021": ["Пистолет Горка-2021", 100, 100, "20%", 80, 1, 0, 10, 50, "Обычный", 18, 18, 4],
    "Револьвер Доводчик": ["Револьвер Доводчик", 100, 100, "35%", 90, 1, 0, 10, 35, "Обычный", 6, 6, 4],
    "Дробовик Роза 33 Картечь": ["Дробовик Роза 33 Картечь", 100, 100, "5%", 250, 2, 1, 3, 45, "Обычный", 2, 2, 0],
    "Дробовик Роза 33 Пуля": ["Дробовик Роза 33 Пуля", 100, 100, "20%", 115, 2, 1, 3, 45, "Обычный", 2, 2, 0],
    "Дробовик Гора Б88 Картечь": ["Дробовик Гора Б88 Картечь", 100, 100, "5%", 250, 1, 0, 5, 25, "Обычный", 6, 6, 6],
    "Дробовик Гора Б88 Пуля": ["Дробовик Гора Б88 Пуля", 100, 100, "20%", 115, 1, 0, 5, 25, "Обычный", 6, 6, 6],
    "Дробовик Ремень 787 Картечь": ["Дробовик Ремень 787 Картечь", 100, 100, "5%", 250, 1, 0, 4, 55, "Обычный", 5, 5, 6],
    "Дробовик Ремень 787 Пуля": ["Дробовик Ремень 787 Пуля", 100, 100, "20%", 115, 1, 0, 4, 55, "Обычный", 5, 5, 6],
    "Дробовик Спаситель 70 Картечь": ["Дробовик Спаситель 70 Картечь", 100, 100, "5%", 250, 1, 1, 7, 35, "Обычный", 8, 8, 6],
    "Дробовик Спаситель 70 Пуля": ["Дробовик Спаситель 70 Пуля", 100, 100, "20%", 115, 1, 1, 7, 35, "Обычный", 8, 8, 6],
    "Дробовик Гора 580Б2 Картечь": ["Дробовик Гора 580Б2 Картечь", 100, 100, "5%", 250, 1, 1, 8, 40, "Обычный", 5, 5, 6],
    "Дробовик Гора 580Б2 Пуля": ["Дробовик Гора 580Б2 Пуля", 100, 100, "20%", 115, 1, 1, 8, 40, "Обычный", 5, 5, 6],
    "Дробовик Кукушка 12 Картечь": ["Дробовик Кукушка 12 Картечь", 100, 100, "5%", 250, 3, 2, 8, 40, "Обычный", 5, 5, 6],
    "Дробовик Кукушка 12 Пуля": ["Дробовик Кукушка 12 Пуля", 100, 100, "20%", 115, 3, 2, 8, 40, "Обычный", 5, 5, 6],
    "Дробовик Д2 Картечь": ["Дробовик Д2 Картечь", 100, 100, "5%", 250, 2, 0, 6, 55, "Обычный", 16, 16, 0],
    "Дробовик Д2 Пуля": ["Дробовик Д2 Пуля", 100, 100, "20%", 115, 2, 0, 6, 55, "Обычный", 16, 16, 0],
    "ПП СП5 компакт": ["ПП СП5 компакт", 100, 100, "15%", 60, 3, 0, 4, 65, "Обычный", 20, 20, 2],
    "ПП Пихта": ["ПП Пихта", 100, 100, "5%", 50, 4, 0, 8, 60, "Обычный", 20, 20, 2],
    "ПП КГБ-У": ["ПП КГБ-У", 100, 100, "15%", 60, 5, -1, 6, 60, "Обычный", 25, 25, 2],
    "ПП ГАЛЬ": ["ПП ГАЛЬ", 100, 100, "15%", 60, 5, 0, 8, 60, "Обычный", 30, 30, 2],
    "ПП Тихонова": ["ПП Тихонова", 100, 100, "25%", 65, 5, 0, 4, 45, "Обычный", 30, 30, 2],
    "ПП СП5": ["ПП СП5", 100, 100, "15%", 60, 3, 1, 12, 55, "Обычный", 30, 30, 1],
    "ПП-1901 Богатырь": ["ПП-1901 Богатырь", 100, 100, "15%", 60, 3, 1, 10, 60, "Обычный", 30, 30, 0],
    "ПП Конева": ["ПП Конева", 100, 100, "15%", 75, 3, 0, 8, 45, "Обычный", 35, 35, 2],
    "ПП Петухова": ["ПП Петухова", 100, 100, "25%", 55, 5, 0, 6, 50, "Обычный", 50, 50, 2],
    "ПП УмКа-88": ["ПП УмКа-88", 100, 100, "25%", 65, 3, 1, 8, 65, "Обычный", 25, 25, 1],
    "ПП СП10": ["ПП СП10", 100, 100, "15%", 60, 4, 2, 10, 65, "Обычный", 20, 20, 2],
    "ПП 0002": ["ПП 0002", 100, 100, "15%", 60, 5, 1, 6, 85, "Обычный", 20, 20, 2],
    "ПП-19 Буйвол": ["ПП-19 Буйвол", 100, 100, "15%", 60, 8, 0, 8, 40, "Обычный", 64, 64, 2],
    "ПП Шмель-4М": ["ПП Шмель-4М", 100, 100, "15%", 60, 4, 1, 10, 55, "Обычный", 30, 30, 0],
    "ПП Среда-3": ["ПП Среда-3", 100, 100, "20%", 80, 4, 1, 6, 70, "Обычный", 20, 20, 2],
    "ПП СП Коч-7": ["ПП СП Коч-7", 100, 100, "35%", 50, 5, 2, 8, 65, "Обычный", 30, 30, 2],
    "Кукушка-МК 5": ["Кукушка-МК 5", 100, 100, "25%", 80, 1, 2, 7, 35, "Обычный", 10, 10, 4],
    "Кукушка-МК 7": ["Кукушка-МК 7", 100, 100, "35%", 90, 1, 1, 7, 30, "Обычный", 10, 10, 4],
    "ШКЛ 4-22": ["ШКЛ 4-22", 100, 100, "30%", 75, 1, 2, 9, 40, "Обычный", 10, 10, 4],
    "АМС-95У": ["АМС-95У", 100, 100, "25%", 80, 3, 1, 9, 55, "Обычный", 30, 30, 4],
    "АММС": ["АММС", 100, 100, "35%", 90, 3, 1, 10, 45, "Обычный", 30, 30, 4],
    "АМС-95": ["АМС-95", 100, 100, "25%", 80, 4, 2, 15, 50, "Обычный", 30, 30, 4],
    "АМ-556": ["АМ-556", 100, 100, "30%", 75, 3, 3, 15, 60, "Обычный", 30, 30, 4],
    "АЛ-300": ["АЛ-300", 100, 100, "30%", 75, 4, 2, 10, 55, "Обычный", 30, 30, 4],
    "АММ": ["АММ", 100, 100, "35%", 90, 4, 2, 12, 40, "Обычный", 30, 30, 4],
    "Автомат Скарабей": ["Автомат Скарабей", 100, 100, "30%", 75, 3, 4, 14, 60, "Обычный", 30, 30, 2],
    "АММК": ["АММК", 100, 100, "35%", 90, 4, 3, 14, 50, "Обычный", 30, 30, 3],
    "АМОН-96": ["АМОН-96", 100, 100, "25%", 80, 4, 3, 16, 65, "Обычный", 30, 30, 4],
    "АШС-05": ["АШС-05", 100, 100, "55%", 100, 3, 3, 15, 45, "Обычный", 20, 20, 4],
    "АГ-56": ["АГ-56", 100, 100, "30%", 75, 5, 5, 35, 55, "Обычный", 30, 30, 4],
    "АШФ-3000": ["АШФ-3000", 100, 100, "30%", 75, 4, 6, 45, 75, "Обычный", 60, 60, 2],
    "АШШ-12": ["АШШ-12", 100, 100, "40%", 130, 3, 0, 10, 25, "Обычный", 10, 10, 4],
    "БКС-290": ["БКС-290", 100, 100, "25%", 80, 1, 2, 12, 40, "Обычный", 4, 4, 4],
    "СКШ": ["СКШ", 100, 100, "35%", 90, 1, 1, 9, 30, "Обычный", 10, 10, 4],
    "СКТА": ["СКТА", 100, 100, "50%", 110, 1, 1, 12, 25, "Обычный", 20, 20, 4],
    "Болтовая Винтовка Малинова": ["Болтовая Винтовка Малинова", 100, 100, "50%", 110, 1, 1, 12, 30, "Обычный", 5, 5, 4],
    "Рычажный Карабин Жесткарева": ["Рычажный Карабин Жесткарева", 100, 100, "50%", 110, 1, 0, 15, 55, "Обычный", 5, 5, 4],
    "Болтовая Винтовка Мачеха 51": ["Болтовая Винтовка Мачеха 51", 100, 100, "55%", 100, 1, 3, 8, 45, "Обычный", 5, 5, 4],
    "Болтовая Винтовка Свет-99": ["Болтовая Винтовка Свет-99", 100, 100, "50%", 110, 1, 3, 15, 40, "Обычный", 10, 10, 4],
    "Болтовая Винтовка АУ": ["Болтовая Винтовка АУ", 100, 100, "55%", 100, 1, 5, 10, 70, "Обычный", 10, 10, 4],
    "Болтовая Винтовка Пылесос": ["Болтовая Винтовка Пылесос", 100, 100, "40%", 130, 1, 3, 10, 30, "Обычный", 5, 5, 4],
    "СВБ-М": ["СВБ-М", 100, 100, "50%", 110, 1, 6, 22, 35, "Обычный", 10, 10, 4],
    "Энерговинтовка": ["Энерговинтовка", 100, 100, "100%", 250, 1, 4, 90, 20, "Обычный", 10, 10, 4],
    "Миротворец": ["Миротворец", 100, 100, "N-101-2", 100, 1, 0, 20, 50, "Обычный", 1, 1, 4],
    "РОШ-92": ["РОШ-92", 100, 100, "РОШ-92", 2000, 1, 3, 30, 35, "Обычный", 1, 1, 4],
    "РГШ-30": ["РГШ-30", 100, 100, "Вог-17", 100, 1, 0, 18, 10, "Обычный", 5, 5, 4],
    "Рог-7В": ["Рог-7В", 100, 100, "ОГ-7В", 850, 1, 3, 45, 0, "Обычный", 1, 1, 4],
    "Шпиц-6": ["Шпиц-6", 100, 100, "Вог-25", 150, 1, 2, 25, 15, "Обычный", 6, 6, 4],
    "Ручной пулемет Марьянова - 39": ["Ручной пулемет Марьянова - 39", 100, 100, "25%", 80, 5, 0, 10, 50, "Обычный", 95, 95, 0.5],
    "Варяг-К": ["Варяг-К", 100, 100, "30%", 75, 5, 0, 10, 15, "Обычный", 100, 100, 0.5],
    "Пулемет Душман-У": ["Пулемет Душман-У", 100, 100, "40%", 130, 5, -2, 10, 0, "Обычный", 50, 50, 1],
    "ПМП Турок": ["ПМП Турок", 100, 100, "50%", 110, 5, -1, 10, 5, "Обычный", 100, 100, 0.5],
    "Пулемет Герцог 12Б3": ["Пулемет Герцог 12Б3", 100, 100, "55%", 100, 5, 4, 15, 45, "Обычный", 100, 100, 0],
    "Пистолет МПС - Шторм": ["Пистолет МПС - Шторм", 100, 100, "25%", 95, 2, 3, 4, 100, "Обычный", 2, 2, 0],
    "Револьвер Оцелот-4С": ["Револьвер Оцелот-4С", 100, 100, "25%", 95, 1, 1, 6, 65, "Обычный", 5, 5, 4],
    "Пистолет СПБ": ["Пистолет СПБ", 100, 100, "25%", 95, 1, 3, 6, 85, "Обычный", 6, 6, 4],
    "Болтовая Винтовка Головаева Тактическая": ["Болтовая Винтовка Головаева Тактическая", 100, 100, "5%", 50, 1, 5, 40, 60, "Обычный", 10, 10, 4],
    "АС 19-Б10": ["АС 19-Б10", 100, 100, "20%", 80, 3, 1, 8, 55, "Обычный", 20, 20, 4],
    "АМСТ": ["АМСТ", 100, 100, "20%", 80, 3, 1, 8, 50, "Обычный", 20, 20, 4],
    "Гранатомет Дьявол Бесшумный": ["Гранатомет Дьявол Бесшумный", 100, 100, "Вог-25", 150, 1, 2, 24, 40, "Обычный", 5, 5, 4],
    "Автоматический Дробовик Отбойник Картечь": ["Автоматический Дробовик Отбойник Картечь", 100, 100, "5%", 250, 5, 4, 18, 60, "Обычный", 10, 10, 6],
    "Автоматический Дробовик Отбойник Пуля": ["Автоматический Дробовик Отбойник Пуля", 100, 100, "20%", 115, 5, 4, 18, 60, "Обычный", 10, 10, 6],
    "АСБ-15у": ["АСБ-15у", 100, 100, "20%", 80, 5, 3, 25, 50, "Обычный", 20, 20, 4],
    "АСС": ["АСС", 100, 100, "20%", 80, 4, 3, 15, 60, "Обычный", 20, 20, 4],
    "СВБ": ["СВБ", 100, 100, "50%", 110, 1, 4, 18, 50, "Обычный", 10, 10, 4]
}
# Оружие: Название, кол-во патронов в магазине, прочность, максимальная прочность, бронебойность, урон, очередь
weaponDict = {
    "Пистолет Зосимова": ["Пистолет Зосимова", 8, 100, 100, "5%", 50, 1],
    "Револьвер Оцелот-5": ["Револьвер Оцелот-5", 5, 100, 100, "5%", 50, 1],
    "Пистолет Крепость-12": ["Пистолет Крепость-12", 12, 100, 100, "5%", 50, 2],
    "Пистолет Февраля": ["Пистолет Крепость-12", 14, 100, 100, "15%", 60, 1],
    "Пистолет Вольер-66": ["Пистолет Вольер-66", 16, 100, 100, "15%", 60, 1],
    "Пистолет Батальон": ["Пистолет Батальон", 12, 100, 100, "25%", 65, 1],
    "Пистолет Двадцать-восемь": ["Пистолет Двадцать-восемь", 20, 100, 100, "25%", 55, 1],
    "Пистолет ДД": ["Пистолет ДД", 8, 100, 100, "15%", 75, 1],
    "Пистолет Альпинист": ["Пистолет Альпинист", 7, 100, 100, "25%", 65, 1],
    "Револьвер Slon": ["Револьвер Slon", 5, 100, 100, "20%", 80, 1],
    "Пистолет Горка-2021": ["Пистолет Горка-2021", 18, 100, 100, "20%", 80, 1],
    "Револьвер Доводчик": ["Револьвер Доводчик", 6, 100, 100, "35%", 90, 1],
    "Дробовик Роза 33 Картечь": ["Дробовик Роза 33 Картечь", 2, 100, 100, "5%", 250, 2],
    "Дробовик Роза 33 Пуля": ["Дробовик Роза 33 Пуля", 2, 100, 100, "20%", 115, 2],
    "Дробовик Гора Б88 Картечь": ["Дробовик Гора Б88 Картечь", 6, 100, 100, "5%", 250, 1],
    "Дробовик Гора Б88 Пуля": ["Дробовик Гора Б88 Пуля", 6, 100, 100, "20%", 115, 1],
    "Дробовик Ремень 787 Картечь": ["Дробовик Ремень 787 Картечь", 5, 100, 100, "5%", 250, 1],
    "Дробовик Ремень 787 Пуля": ["Дробовик Ремень 787 Пуля", 5, 100, 100, "20%", 115, 1],
    "Дробовик Спаситель 70 Картечь": ["Дробовик Спаситель 70 Картечь", 8, 100, 100, "5%", 250, 1],
    "Дробовик Спаситель 70 Пуля": ["Дробовик Спаситель 70 Пуля", 8, 100, 100, "20%", 115, 1],
    "Дробовик Гора 580Б2 Картечь": ["Дробовик Гора 580Б2 Картечь", 5, 100, 100, "5%", 250, 1],
    "Дробовик Гора 580Б2 Пуля": ["Дробовик Гора 580Б2 Пуля", 5, 100, 100, "20%", 115, 1, 1, 8, 40, "Обычный", 5, 5, 6],
    "Дробовик Кукушка 12 Картечь": ["Дробовик Кукушка 12 Картечь", 5, 100, 100, "5%", 250, 3],
    "Дробовик Кукушка 12 Пуля": ["Дробовик Кукушка 12 Пуля", 5, 100, 100, "20%", 115, 3],
    "Дробовик Д2 Картечь": ["Дробовик Д2 Картечь", 16, 100, 100, "5%", 250, 2],
    "Дробовик Д2 Пуля": ["Дробовик Д2 Пуля", 16, 100, 100, "20%", 115, 2],
    "ПП СП5 компакт": ["ПП СП5 компакт", 20, 100, 100, "15%", 60, 3],
    "ПП Пихта": ["ПП Пихта", 20, 100, 100, "5%", 50, 4],
    "ПП КГБ-У": ["ПП КГБ-У", 25, 100, 100, "15%", 60, 5],
    "ПП ГАЛЬ": ["ПП ГАЛЬ", 30, 100, 100, "15%", 60, 5],
    "ПП Тихонова": ["ПП Тихонова", 30, 100, 100, "25%", 65, 5],
    "ПП СП5": ["ПП СП5", 30, 100, 100, "15%", 60, 3],
    "ПП-1901 Богатырь": ["ПП-1901 Богатырь", 30, 100, 100, "15%", 60, 3],
    "ПП Конева": ["ПП Конева", 35, 100, 100, "15%", 75, 3],
    "ПП Петухова": ["ПП Петухова", 50, 100, 100, "25%", 55, 5],
    "ПП УмКа-88": ["ПП УмКа-88", 25, 100, 100, "25%", 65, 3],
    "ПП СП10": ["ПП СП10", 20, 100, 100, "15%", 60, 4],
    "ПП 0002": ["ПП 0002", 20, 100, 100, "15%", 60, 5],
    "ПП-19 Буйвол": ["ПП-19 Буйвол", 64, 100, 100, "15%", 60, 8],
    "ПП Шмель-4М": ["ПП Шмель-4М", 30, 100, 100, "15%", 60, 4],
    "ПП Среда-3": ["ПП Среда-3", 20, 100, 100, "20%", 80, 4],
    "ПП СП Коч-7": ["ПП СП Коч-7", 30, 100, 100, "35%", 50, 5],
    "Кукушка-МК 5": ["Кукушка-МК 5", 10, 100, 100, "25%", 80, 1],
    "Кукушка-МК 7": ["Кукушка-МК 7", 10, 100, 100, "35%", 90, 1],
    "ШКЛ 4-22": ["ШКЛ 4-22", 10, 100, 100, "30%", 75, 1],
    "АМС-95У": ["АМС-95У", 30, 100, 100, "25%", 80, 3],
    "АММС": ["АММС", 100, 30, 100, "35%", 90, 3],
    "АМС-95": ["АМС-95", 30, 100, 100, "25%", 80, 4],
    "АМ-556": ["АМ-556", 30, 100, 100, "30%", 75, 3],
    "АЛ-300": ["АЛ-300", 30, 100, 100, "30%", 75, 4],
    "АММ": ["АММ", 30, 100, 100, "35%", 90, 4],
    "Автомат Скарабей": ["Автомат Скарабей", 30, 100, 100, "30%", 75, 3],
    "АММК": ["АММК", 30, 100, 100, "35%", 90, 4],
    "АМОН-96": ["АМОН-96", 30, 100, 100, "25%", 80, 4],
    "АШС-05": ["АШС-05", 20, 100, 100, "55%", 100, 3],
    "АГ-56": ["АГ-56", 30, 100, 100, "30%", 75, 5],
    "АШФ-3000": ["АШФ-3000", 60, 100, 100, "30%", 75, 4],
    "АШШ-12": ["АШШ-12", 10, 100, 100, "40%", 130, 3],
    "БКС-290": ["БКС-290", 4, 100, 100, "25%", 80, 1],
    "СКШ": ["СКШ", 10, 100, 100, "35%", 90, 1],
    "СКТА": ["СКТА", 20, 100, 100, "50%", 110, 1],
    "Болтовая Винтовка Малинова": ["Болтовая Винтовка Малинова", 5, 100, 100, "50%", 110, 1],
    "Рычажный Карабин Жесткарева": ["Рычажный Карабин Жесткарева", 5, 100, 100, "50%", 110, 1],
    "Болтовая Винтовка Мачеха 51": ["Болтовая Винтовка Мачеха 51", 5, 100, 100, "55%", 100, 1],
    "Болтовая Винтовка Свет-99": ["Болтовая Винтовка Свет-99", 10, 100, 100, "50%", 110, 1],
    "Болтовая Винтовка АУ": ["Болтовая Винтовка АУ", 10, 100, 100, "55%", 100, 1],
    "Болтовая Винтовка Пылесос": ["Болтовая Винтовка Пылесос", 5, 100, 100, "40%", 130, 1],
    "СВБ-М": ["СВБ-М", 10, 100, 100, "50%", 110, 1],
    "Энерговинтовка": ["Энерговинтовка", 10, 100, 100, "100%", 250, 1],
    "Миротворец": ["Миротворец", 1, 100, 100, "N-101-2", 100, 1],
    "РОШ-92": ["РОШ-92", 1, 100, 100, "РОШ-92", 2000, 1],
    "РГШ-30": ["РГШ-30", 5, 100, 100, "Вог-17", 100, 1],
    "Рог-7В": ["Рог-7В", 1, 100, 100, "ОГ-7В", 850, 1],
    "Шпиц-6": ["Шпиц-6", 6, 100, 100, "Вог-25", 150, 1],
    "Ручной пулемет Марьянова - 39": ["Ручной пулемет Марьянова - 39", 95, 100, 100, "25%", 80, 5],
    "Варяг-К": ["Варяг-К", 100, 100, 100, "30%", 75, 5],
    "Пулемет Душман-У": ["Пулемет Душман-У", 50, 100, 100, "40%", 130, 5],
    "ПМП Турок": ["ПМП Турок", 100, 100, 100, "50%", 110, 5],
    "Пулемет Герцог 12Б3": ["Пулемет Герцог 12Б3", 100, 100, 100, "55%", 100, 5],
    "Пистолет МПС - Шторм": ["Пистолет МПС - Шторм", 2, 100, 100, "25%", 95, 2],
    "Револьвер Оцелот-4С": ["Револьвер Оцелот-4С", 5, 100, 100, "25%", 95, 1],
    "Пистолет СПБ": ["Пистолет СПБ", 6, 100, 100, "25%", 95, 1],
    "Болтовая Винтовка Головаева Тактическая": ["Болтовая Винтовка Головаева Тактическая", 10, 100, 100, "5%", 50, 1],
    "АС 19-Б10": ["АС 19-Б10", 20, 100, 100, "20%", 80, 3],
    "АМСТ": ["АМСТ", 20, 100, 100, "20%", 80, 3],
    "Гранатомет Дьявол Бесшумный": ["Гранатомет Дьявол Бесшумный", 5, 100, 100, "Вог-25", 150, 1],
    "Автоматический Дробовик Отбойник Картечь": ["Автоматический Дробовик Отбойник Картечь", 10, 100, 100, "5%", 250, 5],
    "Автоматический Дробовик Отбойник Пуля": ["Автоматический Дробовик Отбойник Пуля", 10, 100, 100, "20%", 115, 5],
    "АСБ-15у": ["АСБ-15у", 20, 100, 100, "20%", 80, 5],
    "АСС": ["АСС", 20, 100, 100, "20%", 80, 4],
    "СВБ": ["СВБ", 10, 100, 100, "50%", 110, 1],
}

weaponsTier1 = ['Пистолет Зосимова', 'Револьвер Оцелот-5', 'Пистолет Крепость-12', 'Пистолет Февраля',
                'Пистолет Вольер-66', 'Пистолет Батальон', 'Пистолет Двадцать-восемь', 'Пистолет ДД',
                'Револьвер Slon', 'Револьвер Доводчик', 'Дробовик Роза 33 Картечь', 'Дробовик Ремень 787 Картечь',
                'ПП СП5 компакт', 'ПП Пихта', 'ПП КГБ-У', 'ПП ГАЛЬ', 'Кукушка-МК 5', 'Кукушка-МК 7', 'ШКЛ 4-22',
                'БКС-290', 'СКШ', 'Болтовая Винтовка Малинова']
weaponsTier1Plus = ['Дробовик Роза 33 Пуля', 'Пистолет Горка-2021', 'Пистолет Альпинист',
                    'Дробовик Ремень 787 Пуля', 'ПП Конева', 'ПП УмКа-88', 'АМС-95У', 'АММС',
                    'СКТА', 'Рычажный Карабин Жесткарева', 'Пистолет МПС - Шторм', 'Револьвер Оцелот-4С', 'Пистолет СПБ']
weaponsTier2 = ['ПП Тихонова', 'ПП СП5', 'ПП-1901 Богатырь', 'Револьвер Доводчик', 'Дробовик Гора Б88 Картечь',
                'Дробовик Гора Б88 Пуля', 'Дробовик Спаситель 70 Картечь', 'Дробовик Спаситель 70 Пуля',
                'Дробовик Гора 580Б2 Картечь', 'Дробовик Гора 580Б2 Пуля', 'Дробовик Кукушка 12 Картечь',
                'ПП СП10', 'ПП 0002', 'АМС-95', 'АМ-556', 'АЛ-300', 'АММ', 'Болтовая Винтовка Мачеха 51',
                'Болтовая Винтовка Свет-99', 'Болтовая Винтовка Головаева Тактическая']
weaponsTier2Plus = ['Дробовик Кукушка 12 Пуля', 'Дробовик Д2 Картечь', 'ПП Петухова', 'ПП-19 Буйвол', 'ПП Шмель-4М',
                    'ПП Среда-3', 'Миротворец', 'Ручной пулемет Марьянова - 39', 'АС 19-Б10', 'АМСТ']
weaponsTier3 = ['Дробовик Д2 Пуля', 'ПП СП Коч-7', 'Автомат Скарабей', 'АММК', 'Болтовая Винтовка АУ', 'Варяг-К', 'СВБ']
weaponsTier3Plus = ['АМОН-96', 'АШС-05', 'СВБ-М', 'АСС', 'Автоматический Дробовик Отбойник Картечь']
weaponsTierS = ['АГ-56', 'АШФ-3000', 'АШШ-12', 'Болтовая Винтовка Пылесос', 'РОШ-92', 'РГШ-30', 'Рог-7В', 'Шпиц-6',
                'Пулемет Душман-У', 'ПМП Турок', 'Пулемет Герцог 12Б3', 'Гранатомет Дьявол Бесшумный', 'АСБ-15у',
                'Автоматический Дробовик Отбойник Пуля']

# Гранаты
grenadeTier1 = [["Ничего", 0], ["Ничего", 0], ["Муляж", 1], ["РГД-5", 1], ["РДГ-6", 1], ["Заря", 1]]
grenadeTier1Plus = [["РГД-5", 2], ["РДГ-6", 2], ["Заря", 2]]
grenadeTier2 = [["Ничего", 0], ["Ф-1", 1], ["РГН", 1], ["Дымовая граната Screen", 1], ["Светошумовая граната Факел", 1], ["Светошумовая граната Flash-M2", 1], ["Граната Bang-79-3", 1], ["Химическая граната Refresher", 1]]
grenadeTier2Plus = [["Ф-1", 2], ["РГН", 2], ["Дымовая граната Screen", 2], ["Светошумовая граната Факел", 2], ["Светошумовая граната Flash-M2", 2], ["Граната Bang-79-3", 2], ["Химическая граната Refresher", 2]]
grenadeTier3 = [["Ф-1", 3], ["РГН", 3], ["Дымовая граната Screen", 3], ["Светошумовая граната Факел", 3], ["Светошумовая граната Flash-M2", 3], ["Граната Bang-79-3", 3], ["Химическая граната Refresher", 3]]
grenadeTier3Plus = [["Зажигательная граната Napalm-AN", 1], ["Химическая граната Черемуха", 1], ["Термобарическая граната РГ-60ТБ", 1]]
grenadeTierS = [["Зажигательная граната Napalm-AN", 2], ["Химическая граната Черемуха", 2], ["Термобарическая граната РГ-60ТБ", 2]]

# Броня: Название, прочность, материал, физическая защита, химическая защита, термическая защита, электрическая защита, защита от радиации, штраф к перемещению, стадия целостности, хп стадии
fullArmorDict = {
    "Без брони": ["Без брони", 10000, "Текстиль", "0%", "0%", "0%", "0%", "0%", 0, "Целая", 50000],
    "Кожаная куртка": ["Кожаная куртка", 10, "Текстиль", "5%", "10%", "5%", "5%", "0%", 0, "Целая", 50],
    "Бандитская куртка": ["Бандитская куртка", 12, "Текстиль", "10%", "15%", "15%", "10%", "0%", 0, "Целая", 60],
    "Костюм Химзащиты": ["Костюм Химзащиты", 20, "Текстиль", "0%", "20%", "20%", "20%", "25%", 1, "Целая", 100],
    "Броня путника": ["Броня путника", 15, "Композит", "20%", "10%", "10%", "10%", "0%", 1, "Целая", 150],
    "Бронекостюм": ["Бронекостюм", 20, "Кевлар", "25%", "20%", "20%", "20%", "20%", 2, "Целая", 300],
    "Комбинезон Купол": ["Комбинезон Купол", 35, "Текстиль", "10%", "55%", "55%", "55%", "55%", 2, "Целая", 175],
    "Бронекостюм Затвор": ["Бронекостюм Затвор", 35, "Плита", "55%", "25%", "25%", "25%", "25%", 4, "Целая", 700],
    "Комбинезон Сокол": ["Комбинезон Сокол", 25, "Кевлар", "30%", "45%", "45%", "45%", "50%", 3, "Целая", 375],
    "Комбинезон налетчика": ["Комбинезон налетчика", 30, "Композит", "35%", "40%", "20%", "20%", "55%", 2, "Целая", 300],
    "Комбинезон Весы": ["Комбинезон Весы", 35, "Кевлар", "40%", "35%", "35%", "35%", "35%", 3, "Целая", 525],
    "Комбинезон Страж": ["Комбинезон Страж", 40, "Плита", "45%", "30%", "30%", "30%", "45%", 2, "Целая", 800],
    "Бронекостюм Литейщик": ["Бронекостюм Литейщик", 45, "Плита", "50%", "50%", "50%", "50%", "50%", 3, "Целая", 900],
    "Бронекостюм ПШНХ-2": ["Бронекостюм ПШНХ-2", 50, "Плита", "65%", "45%", "45%", "45%", "45%", 5, "Целая", 1000],
    "Армейский бронежилет": ["Армейский бронежилет", 25, "Кевлар", "55%", "40%", "40%", "40%", "50%", 3, "Целая", 375],
    "Комбинезон Ветер": ["Комбинезон Ветер", 40, "Кевлар", "35%", "35%", "35%", "65%", "55%", -1, "Целая", 600],
    "Экзоскелет": ["Экзоскелет", 90, "Композит", "80%", "30%", "30%", "30%", "35%", 5, "Целая", 900],
    "Комбинезон Купол-М": ["Комбинезон Купол-М", 75, "Текстиль", "35%", "65%", "65%", "65%", "65%", 3, "Целая", 375],
    "Комбинезон ГРОБ": ["Комбинезон ГРОБ", 50, "Композит", "40%", "65%", "60%", "60%", "65%", 3, "Целая", 500],
    # Улучшенные версии
    "Кожаная куртка ФИЗ": ["Кожаная куртка ФИЗ", 17, "Текстиль", "20%", "10%", "5%", "5%", "0%", 1, "Целая", 85],
    "Кожаная куртка АНОМ": ["Кожаная куртка АНОМ", 14, "Текстиль", "5%", "25%", "20%", "20%", "15%", 1, "Целая", 70],
    "Бандитская куртка ФИЗ": ["Бандитская куртка ФИЗ", 20, "Текстиль", "30%", "15%", "20%", "10%", "0%", 0, "Целая", 100],
    "Бандитская куртка ПРЕСТИЖ": ["Бандитская куртка ПРЕСТИЖ", 12, "Текстиль", "10%", "15%", "25%", "10%", "0%", 0, "Целая", 60],
    "Костюм Химзащиты АНОМ": ["Костюм Химзащиты АНОМ", 20, "Текстиль", "0%", "45%", "30%", "30%", "35%", 1, "Целая", 100],
    "Костюм Химзащиты Капельница": ["Костюм Химзащиты Капельница", 20, "Текстиль", "0%", "20%", "20%", "20%", "25%", 1, "Целая", 100],
    "Костюм Химзащиты РАД": ["Костюм Химзащиты РАД", 20, "Текстиль", "0%", "20%", "20%", "20%", "50%", 2, "Целая", 100],
    "Броня путника ФИЗ/Облегчение1": ["Броня путника ФИЗ/Облегчение1", 15, "Композит", "40%", "10%", "5%", "5%", "0%", 1, "Целая", 150],
    "Бронекостюм Облегчение2 + Физ1": ["Бронекостюм Облегчение2 + Физ1", 22, "Кевлар", "25%", "20%", "20%", "20%", "20%", 0, "Целая", 340],
    "Бронекостюм ФИЗ": ["Бронекостюм ФИЗ", 30, "Кевлар", "55%", "20%", "20%", "20%", "20%", 2, "Целая", 450],
    "Бронекостюм РАД": ["Бронекостюм РАД", 25, "Кевлар", "30%", "20%", "20%", "20%", "55%", 3, "Целая", 375],
    "Комбинезон Купол Аном2": ["Комбинезон Купол Аном2", 35, "Текстиль", "10%", "75%", "75%", "75%", "75%", 2, "Целая", 175],
    "Комбинезон Купол ФИЗ": ["Комбинезон Купол ФИЗ", 35, "Текстиль", "35%", "55%", "55%", "55%", "55%", 3, "Целая", 175],
    "Бронекостюм Затвор АНОМ": ["Бронекостюм Затвор АНОМ", 35, "Плита", "55%", "45%", "45%", "35%", "40%", 4, "Целая", 700],
    "Бронекостюм Затвор Гора1 + Защитник1 + Аном1": ["Бронекостюм Затвор Гора1 + Защитник1 + Аном1", 39, "Плита", "65%", "30%", "30%", "30%", "30%", 4, "Целая", 780],
    "Комбинезон Сокол ФИЗ": ["Комбинезон Сокол ФИЗ", 32, "Кевлар", "60%", "45%", "45%", "45%", "50%", 3, "Целая", 460],
    "Комбинезон Сокол АНОМ": ["Комбинезон Сокол АНОМ", 25, "Кевлар", "30%", "60%", "70%", "60%", "65%", 3, "Целая", 375],
    "Комбинезон налетчика ФИЗ": ["Комбинезон налетчика ФИЗ", 38, "Композит", "55%", "40%", "20%", "20%", "55%", 2, "Целая", 380],
    "Комбинезон налетчика АНОМ": ["Комбинезон налетчика АНОМ", 30, "Композит", "40%", "45%", "45%", "45%", "60%", 2, "Целая", 300],
    "Комбинезон Весы ФИЗ": ["Комбинезон Весы ФИЗ", 55, "Кевлар", "60%", "35%", "35%", "35%", "35%", 3, "Целая", 825],
    "Комбинезон Весы АНОМ": ["Комбинезон Весы АНОМ", 35, "Кевлар", "40%", "60%", "60%", "50%", "55%", 3, "Целая", 525],
    "Комбинезон Весы КОМБО": ["Комбинезон Весы КОМБО", 44, "Кевлар", "55%", "50%", "50%", "50%", "50%", 4, "Целая", 660],
    "Комбинезон Страж ФИЗ": ["Комбинезон Страж ФИЗ", 40, "Плита", "75%", "30%", "30%", "30%", "45%", 2, "Целая", 800],
    "Комбинезон Страж АНОМ": ["Комбинезон Страж АНОМ", 40, "Плита", "45%", "60%", "60%", "60%", "75%", 2, "Целая", 800],
    "Бронекостюм Литейщик ФИЗ": ["Бронекостюм Литейщик ФИЗ", 50, "Плита", "75%", "50%", "50%", "50%", "50%", 3, "Целая", 1000],
    "Бронекостюм ПШНХ-2 АНОМ": ["Бронекостюм ПШНХ-2 АНОМ", 60, "Плита", "70%", "60%", "60%", "65%", "60%", 5, "Целая", 1200],
    "Армейский бронежилет Физ2": ["Армейский бронежилет Физ2", 28, "Кевлар", "70%", "40%", "40%", "40%", "50%", 3, "Целая", 420],
    "Комбинезон Ветер АНОМ": ["Комбинезон Ветер АНОМ", 50, "Кевлар", "40%", "45%", "45%", "80%", "65%", -1, "Целая", 750],
    "Экзоскелет ФИЗ": ["Экзоскелет ФИЗ", 90, "Композит", "100%", "30%", "30%", "30%", "35%", 5, "Целая", 900],
    "Экзоскелет Оборона2": ["Экзоскелет Оборона2", 92, "Композит", "90%", "35%", "35%", "35%", "40%", 5, "Целая", 920],
    "Комбинезон Купол-М ФИЗ": ["Комбинезон Купол-М ФИЗ", 90, "Текстиль", "60%", "65%", "65%", "65%", "65%", 3, "Целая", 450],
    "Комбинезон Купол-М АНОМ": ["Комбинезон Купол-М АНОМ", 75, "Текстиль", "35%", "95%", "95%", "95%", "100%", 3, "Целая", 375],
    "Комбинезон ГРОБ ФИЗ": ["Комбинезон ГРОБ", 55, "Композит", "55%", "65%", "60%", "60%", "65%", 4, "Целая", 550]
}

armorTier1 = ["Без брони", "Кожаная куртка", "Бандитская куртка", "Костюм Химзащиты"]
armorTier1Plus = ["Броня путника", "Кожаная куртка ФИЗ", "Кожаная куртка АНОМ", "Бандитская куртка ФИЗ",
                  "Костюм Химзащиты АНОМ", "Костюм Химзащиты Капельница", "Костюм Химзащиты РАД",
                  "Броня путника ФИЗ/Облегчение1", "Бандитская куртка ПРЕСТИЖ"]
armorTier2 = ["Бронекостюм", "Комбинезон Купол", "Комбинезон Сокол", "Комбинезон налетчика", "Бронекостюм Затвор"]
armorTier2Plus = ["Бронекостюм Облегчение2 + Физ1", "Бронекостюм ФИЗ", "Бронекостюм РАД", "Комбинезон Купол Аном2",
                  "Комбинезон Купол ФИЗ", "Бронекостюм Затвор АНОМ", "Бронекостюм Затвор Гора1 + Защитник1 + Аном1",
                  "Комбинезон Сокол ФИЗ", "Комбинезон Сокол АНОМ", "Комбинезон налетчика ФИЗ", "Комбинезон налетчика АНОМ"]
armorTier3 = ["Армейский бронежилет", "Комбинезон Ветер", "Бронекостюм Литейщик", "Комбинезон Весы", "Комбинезон Страж", ]
armorTier3Plus = ["Бронекостюм ПШНХ-2", "Комбинезон Весы ФИЗ", "Комбинезон Весы АНОМ", "Комбинезон Весы КОМБО",
                  "Комбинезон Страж ФИЗ", "Комбинезон Страж АНОМ", "Бронекостюм Литейщик ФИЗ", "Армейский бронежилет Физ2",
                  "Комбинезон Ветер АНОМ"]
armorTierS = ["Экзоскелет", "Комбинезон Купол-М", "Комбинезон ГРОБ", "Бронекостюм ПШНХ-2 АНОМ", "Экзоскелет ФИЗ",
              "Экзоскелет Оборона2", "Комбинезон Купол-М ФИЗ", "Комбинезон Купол-М АНОМ", "Комбинезон ГРОБ ФИЗ"]

# Голова: Название, прочность, материал, физическая защита, химическая защита, термическая защита, электрическая защита, защита от радиации, штраф к перемещению, стадия целостности, хп стадии, штраф точности
fullHelmetDict = {
    "Без шлема": ["Без шлема", 10000, "Текстиль", "0%", "0%", "0%", "0%", "0%", 0, "Целая", 50000, 0],
    # Все забрала улучшены "Пропитка забрала спреем", снижающий штраф к точности и харизме до 0
    "Шлем Костюма Химзащиты": ["Шлем Костюма Химзащиты", 1, "Текстиль", "0%", "0%", "0%", "0%", "0%", 0, "Целая", 5, 0],
    "Шлем Купол": ["Шлем Купол", 2, "Текстиль", "15%", "0%", "0%", "0%", "0%", 0, "Целая", 10, 0],
    "Шлем Купол-М": ["Шлем Купол-М", 4, "Текстиль", "35%", "0%", "0%", "0%", "0%", 0, "Целая", 20, 0],
    "Шлем ГРОБ": ["Шлем ГРОБ", 4, "Текстиль", "40%", "0%", "0%", "0%", "0%", 0, "Целая", 20, 0],
    # А у него нет забрала, ну точнее оно есть, но оно не такое стеклянное и на него короче не работает вот
    "Шлем Экзоскелета": ["Шлем Экзоскелета", 90, "Композит", "80%", "0%", "0%", "0%", "0%", 0, "Целая", 900, 2],
    # Прочее
    "Панамка": ["Панамка", 1, "Текстиль", "0%", "0%", "0%", "0%", "0%", 0, "Целая", 5, 0],
    "Кепка": ["Кепка", 1, "Текстиль", "0%", "0%", "0%", "0%", "0%", 0, "Целая", 5, 0],
    "Шапка флисовая": ["Шапка флисовая", 1, "Текстиль", "0%", "0%", "0%", "0%", "0%", 0, "Целая", 5, 0],
    "Балаклава": ["Балаклава", 1, "Текстиль", "0%", "0%", "0%", "0%", "0%", 0, "Целая", 5, 0],
    "Берет": ["Берет", 1, "Текстиль", "0%", "0%", "0%", "0%", "0%", 0, "Целая", 5, 0],
    "Балаклава Призрак": ["Балаклава Призрак", 1, "Текстиль", "0%", "0%", "0%", "0%", "0%", 0, "Целая", 5, 0],
    "Ушанка": ["Ушанка", 5, "Текстиль", "0%", "0%", "5%", "-5%", "0%", 0, "Целая", 25, 0],
    "Ушанка Пафос1": ["Ушанка Пафос1", 5, "Текстиль", "0%", "0%", "10%", "-5%", "0%", 0, "Целая", 25, 0],
    # Противогазы
    "Респиратор": ["Респиратор", 5, "Текстиль", "0%", "5%", "0%", "0%", "10%", 0, "Целая", 25, 1],
    "Противогаз ГП-7": ["Противогаз ГП-7", 10, "Текстиль", "5%", "10%", "5%", "10%", "20%", 1, "Целая", 50, 3],
    "Противогаз ГП-9В": ["Противогаз ГП-9В", 12, "Текстиль", "5%", "15%", "5%", "5%", "20%", 1, "Целая", 60, 1],
    "Противогаз ГП-5": ["Противогаз ГП-5", 8, "Текстиль", "5%", "10%", "10%", "10%", "20%", 0, "Целая", 40, 2],
    "Противогаз Ж-12": ["Противогаз Ж-12", 6, "Текстиль", "0%", "10%", "10%", "5%", "15%", 1, "Целая", 30, 3],
    "Противогаз ПМГ-2": ["Противогаз ПМГ-2", 10, "Текстиль", "5%", "5%", "10%", "10%", "20%", 1, "Целая", 50, 2],
    # Противогазы улучшенные
    "Респиратор Точность": ["Респиратор Точность", 5, "Текстиль", "0%", "5%", "0%", "0%", "10%", 0, "Целая", 25, 0],
    "Противогаз ГП-5 Точность": ["Противогаз ГП-5 Точность", 12, "Текстиль", "5%", "10%", "10%", "15%", "20%", 0, "Целая", 60, 0],
    "Противогаз ГП-7 Точность": ["Противогаз ГП-7 Точность", 14, "Текстиль", "5%", "10%", "5%", "15%", "20%", 1, "Целая", 70, 1],
    "Противогаз ГП-9В Точность": ["Противогаз ГП-9В Точность", 12, "Текстиль", "5%", "15%", "5%", "5%", "20%", 1, "Целая", 60, 0],
    "Противогаз ГП-9В Мобильность": ["Противогаз ГП-9В Мобильность", 12, "Текстиль", "5%", "15%", "5%", "5%", "25%", 0, "Целая", 60, 0],
    "Противогаз Ж-12 Мобильность": ["Противогаз Ж-12 Мобильность", 6, "Текстиль", "0%", "10%", "10%", "5%", "15%", 0, "Целая", 30, 3],
    "Противогаз ПМГ-2 Мобильность": ["Противогаз ПМГ-2 Мобильность", 10, "Текстиль", "5%", "5%", "10%", "10%", "20%", 0, "Целая", 50, 2],
    # Шлема без забрала
    "Строительная каска": ["Строительная каска", 5, "Плита", "10%", "10%", "10%", "10%", "0%", 0, "Целая", 100, 0],
    "Советский Котелок 68Г": ["Советский Котелок 68Г", 12, "Плита", "25%", "0%", "0%", "-10%", "0%", 0, "Целая", 240, 0],
    "Шлем Витязь 4В76": ["Шлем Витязь 4В76", 10, "Плита", "35%", "0%", "0%", "0%", "0%", 0, "Целая", 200, 0],
    "Шлем Ударник": ["Шлем Ударник", 15, "Кевлар", "35%", "0%", "0%", "0%", "0%", 0, "Целая", 225, 0],
    "Шлем Ударник-М": ["Шлем Ударник-М", 18, "Кевлар", "40%", "0%", "0%", "0%", "0%", 0, "Целая", 270, 0],
    "Шлем Первопроходец": ["Шлем Первопроходец", 20, "Кевлар", "55%", "0%", "0%", "0%", "0%", 0, "Целая", 300, 0],
    # Шлема без забрала улучшенные
    "Советский Котелок 68Г ФИЗ": ["Советский Котелок 68Г ФИЗ", 16, "Плита", "30%", "0%", "0%", "0%", "0%", 0, "Целая", 320, 0],
    "Шлем Ударник ФИЗ": ["Шлем Ударник ФИЗ", 15, "Кевлар", "50%", "5%", "5%", "5%", "5%", 0, "Целая", 225, 0],
    "Шлем Ударник-М ФИЗ": ["Шлем Ударник-М ФИЗ", 18, "Кевлар", "55%", "5%", "5%", "5%", "5%", 0, "Целая", 270, 0],
    "Шлем Первопроходец ФИЗ": ["Шлем Первопроходец ФИЗ", 20, "Кевлар", "70%", "5%", "5%", "5%", "5%", 0, "Целая", 300, 0],
    # Шлема-противогазы
    "Шлем Блокпост": ["Шлем Блокпост", 16, "Композит", "30%", "5%", "5%", "5%", "25%", 3, "Целая", 160, 1],
    "Шлем Воевода": ["Шлем Воевода", 20, "Композит", "40%", "10%", "5%", "5%", "30%", 4, "Целая", 200, 2],
    "Шлем Кузнец": ["Шлем Кузнец", 24, "Композит", "50%", "15%", "10%", "10%", "40%", 3, "Целая", 240, 1],
    # Шлема-противогазы улучшенные
    "Шлем Блокпост Физ2": ["Шлем Блокпост Физ2", 16, "Композит", "35%", "10%", "10%", "10%", "30%", 3, "Целая", 160, 1],
    "Шлем Воевода Физ2": ["Шлем Воевода Физ2", 20, "Композит", "45%", "15%", "10%", "10%", "35%", 4, "Целая", 200, 2],
    "Шлем Кузнец Физ2": ["Шлем Кузнец Физ2", 24, "Композит", "55%", "20%", "15%", "15%", "45%", 3, "Целая", 240, 1],
    "Шлем Блокпост ЭРГО": ["Шлем Блокпост ЭРГО", 16, "Композит", "30%", "5%", "5%", "5%", "25%", 1, "Целая", 160, 0],
    "Шлем Воевода ЭРГО": ["Шлем Воевода ЭРГО", 20, "Композит", "40%", "10%", "5%", "5%", "30%", 2, "Целая", 200, 1],
    "Шлем Кузнец ЭРГО": ["Шлем Кузнец ЭРГО", 24, "Композит", "50%", "15%", "10%", "10%", "40%", 1, "Целая", 240, 0],
    # Шлема с забралом
    # Физ защита забрала хоть и отличается от защиты шлема, но учитывать я это не буду, физ защита есть физ защита
    # Все забрала улучшены "Пропитка забрала спреем", снижающий штраф к точности и харизме до 0
    "Шлем КыСа-2": ["Шлем КыСа-2", 8, "Плита", "20%", "5%", "0%", "0%", "0%", 0, "Целая", 160, 0],
    "Шлем Гусар": ["Шлем Гусар", 14, "Плита", "35%", "8%", "5%", "0%", "0%", 0, "Целая", 280, 1],
    "Шлем ШЗ-13м": ["Шлем ШЗ-13м", 16, "Кевлар", "40%", "10%", "0%", "0%", "0%", 1, "Целая", 240, 1],
    "Шлем Карбованец": ["Шлем Карбованец", 20, "Плита", "60%", "10%", "5%", "-10%", "0%", 1, "Целая", 400, 2],
    "Шлем Волк-А": ["Шлем Волк-А", 35, "Плита", "70%", "10%", "5%", "-10%", "0%", 1, "Целая", 700, 2],
    # Шлема с забралом улучшенные
    "Шлем Карбованец Удобство2": ["Шлем Карбованец Удобство2", 20, "Плита", "60%", "10%", "5%", "-10%", "0%", 0, "Целая", 400, 2],
    "Шлем Волк-А Физ2": ["Шлем Волк-А Физ2", 37, "Плита", "80%", "10%", "5%", "-10%", "0%", 1, "Целая", 740, 2]
}

helmetTier1 = ["Без шлема", "Панамка", "Кепка", "Шапка флисовая", "Балаклава", "Берет", "Респиратор", "Противогаз Ж-12",
               "Строительная каска", "Советский Котелок 68Г"]
helmetTier1Plus = ["Балаклава Призрак", "Ушанка", "Ушанка Пафос1", "Противогаз ГП-7", "Противогаз ГП-9В",
                   "Противогаз ГП-5", "Противогаз ПМГ-2", "Респиратор Точность", "Советский Котелок 68Г ФИЗ",
                   "Шлем КыСа-2", "Противогаз Ж-12 Мобильность"]
helmetTier2 = ["Шлем Витязь 4В76", "Шлем Ударник", "Шлем Гусар", "Противогаз ГП-5 Точность", "Противогаз ГП-7 Точность",
               "Противогаз ГП-9В Точность", "Противогаз ГП-9В Мобильность", "Противогаз ПМГ-2 Мобильность", "Шлем Блокпост"]
helmetTier2Plus = ["Шлем Ударник-М", "Шлем ШЗ-13м", "Шлем Блокпост ЭРГО", "Шлем Блокпост Физ2"]
helmetTier3 = ["Шлем Карбованец", "Шлем Ударник-М ФИЗ", "Шлем Первопроходец", "Шлем Воевода"]
helmetTier3Plus = ["Шлем Волк-А", "Шлем Карбованец Удобство2", "Шлем Кузнец", "Шлем Первопроходец ФИЗ", "Шлем Воевода ЭРГО",
                   "Шлем Воевода Физ2"]
helmetTierS = ["Шлем Волк-А Физ2", "Шлем Кузнец ЭРГО", "Шлем Кузнец Физ2"]

firstNameParts = ["Иван", "Александр", "Дмитрий", "Сергей", "Андрей", "Иван", "Максим", "Алексей", "Артём", "Михаил",
                  "Роман", "Евгений", "Николай", "Олег", "Владимир", "Павел", "Игорь", "Константин", "Василий", "Виктор",
                  "Анатолий", "Тимофей", "Григорий", "Антон", "Станислав", "Юрий", "Владислав", "Валентин", "Георгий",
                  "Борис", "Аркадий", "Валерий", "Артур", "Леонид", "Кирилл", "Никита", "Пётр", "Захар", "Фёдор", "Егор",
                  "Герман", "Семён", "Ярослав", "Богдан", "Глеб", "Всеволод", "Святослав", "Родион", "Степан", "Игнат",
                  "Ефим", "Адам", "Данила", "Лев", "Савелий", "Матвей", "Прохор", "Савва", "Тихон", "Аким", "Яков",
                  "Мирон", "Демид", "Марк", "Ратибор", "Юлиан", "Оскар", "Вячеслав", "Тарас", "Елисей", "Платон",
                  "Адриан", "Виталий", "Амир", "Эдуард", "Роберт", "Геннадий", "Альберт", "Вениамин", "Арсен",
                  "Давид", "Назар", "Лазарь", "Мирослав", "Тимур", "Яромир", "Авдей", "Артемий", "Владлен", "Зиновий"]
secondNameParts = ["Бобр", "Хмурый", "Тень", "Змей", "Рысь", "Леший", "Ворон", "Крот", "Гром", "Скала", "Кедр", "Сокол",
                   "Беркут", "Феникс", "Хан", "Шаман", "Дикий", "Бугор", "Ящер", "Токарь", "Капкан", "Ветер", "Гюрза",
                   "Кувалда", "Ржавый", "Череп", "Дракон", "Дым", "Шакал", "Кобра", "Вьюга", "Гроза", "Бес", "Огонь",
                   "Таран", "Хромой", "Пустырь", "Бродяга", "Кабан", "Байкал", "Пуля", "Торнадо", "Сапсан",
                   "Ураган", "Коса", "Тополь", "Рыбак", "Шпала", "Гриф", "Мор", "Технарь", "Шершень", "Варан", "Молот",
                   "Перо", "Батя", "Седой", "Коготь", "Тигр", "Хирург", "Злобный", "Гончар", "Сапёр", "Туман", "Шторм",
                   "Кайман", "Орел", "Базальт", "Клён", "Вепрь", "Крест", "Дрозд", "Крапива", "Краб", "Слон", "Рак",
                   "Немой", "Боров", "Гвоздь", "Гранит", "Горец", "Топор", "Ястреб", "Заря", "Сыч", "Клинок", "Снаряд",
                   "Буря", "Оса", "Мангуст", "Трос", "Альпинист", "Белый", "Чёрный", "Серый", "Плут", "Светляк",
                   "Панцирь", "Скалистый", "Горняк", "Кузнец", "Остряк", "Травник", "Жнец", "Обвал", "Филин", "Щепка",
                   "Маяк", "Вестник", "Колун", "Клык", "Водник", "Штрих", "Чайка", "Зеркало", "Цепь", "Пламя", "Бархан",
                   "Горизонт", "Степняк", "Тайник", "Рассвет", "Штурман", "Сабля", "Голубь", "Мороз", "Затвор", "Шахтёр",
                   "Клин", "Резня", "Проклятый", "Отруб", "Яма", "Бабай", "Железняк", "Камень", "Таран", "Пограничник"]


def generate_name():
    return new_random.choice(firstNameParts) + " " + new_random.choice(secondNameParts)


class EnemyGenerator:
    def __init__(self):
        self.new_enemy = None
        self.fullWeaponDict = fullWeaponDict
        self.fullArmorDict = fullArmorDict
        self.fullHelmetDict = fullHelmetDict
        self.enemy_generate_info = None
        self.last_id = 0

    def generate_enemy(self, enemy_generate_info):
        self.new_enemy = Enemy(self.last_id)
        self.last_id += 1
        self.enemy_generate_info = enemy_generate_info

        self.new_enemy.enemy_name = [generate_name(), self.enemy_generate_info[0]]
        self.new_enemy.weapon = self.generate_weapon()
        self.new_enemy.armor = [self.generate_armor(), "Целая"]
        self.new_enemy.helmet = [self.generate_helmet(self.new_enemy), "Целая"]
        self.new_enemy.skills = self.generate_skills()
        self.new_enemy.grenade = self.generate_grenades()
        self.new_enemy.mobility_debuff = self.generate_mobility_debuff(self.new_enemy)
        self.new_enemy.initiative = self.generate_initiative(self.new_enemy)
        self.new_enemy.enemy_loot = self.generate_enemy_loot()
        self.generate_durability(self.new_enemy)

        return self.new_enemy

    def generate_durability(self, enemy):
        # Броня
        # 1. Противник новичок
        if self.enemy_generate_info[1] == "1. Противник новичок":
            if self.enemy_generate_info[2] in ["3. В достатке", "4. Богат"]:
                if self.enemy_generate_info[2] != "4. Богат":
                    enemy.armor[1] = "Немного повреждена"
                    enemy.helmet[1] = "Немного повреждена"
            else:
                enemy.armor[1] = "Повреждена"
                enemy.helmet[1] = "Повреждена"
        # 2. Противник опытный/ветеран
        elif self.enemy_generate_info[1] in ["2. Противник опытный", "3. Противник ветеран"]:
            if self.enemy_generate_info[2] in ["3. В достатке", "4. Богат"]:
                pass
            else:
                enemy.armor[1] = "Немного повреждена"
                enemy.helmet[1] = "Немного повреждена"

        # Оружие
        # 1. Противник новичок
        if self.enemy_generate_info[1] == "1. Противник новичок":
            if self.enemy_generate_info[2] == "4. Богат":
                max_durability = random.randint(95, 100)
                enemy.weapon[2] = max_durability - 2
                enemy.weapon[3] = max_durability
            elif self.enemy_generate_info[2] == "3. В достатке":
                max_durability = random.randint(85, 95)
                enemy.weapon[2] = max_durability - 3
                enemy.weapon[3] = max_durability
            elif self.enemy_generate_info[2] == "2. Средний класс":
                max_durability = random.randint(65, 85)
                enemy.weapon[2] = max_durability - 5
                enemy.weapon[3] = max_durability
            else:
                max_durability = random.randint(50, 65)
                enemy.weapon[2] = max_durability - 10
                enemy.weapon[3] = max_durability
        # 2. Противник опытный
        elif self.enemy_generate_info[1] == "2. Противник опытный":
            if self.enemy_generate_info[2] == "4. Богат":
                max_durability = random.randint(90, 95)
                enemy.weapon[2] = max_durability - 2
                enemy.weapon[3] = max_durability
            elif self.enemy_generate_info[2] == "3. В достатке":
                max_durability = random.randint(85, 90)
                enemy.weapon[2] = max_durability - 3
                enemy.weapon[3] = max_durability
            elif self.enemy_generate_info[2] == "2. Средний класс":
                max_durability = random.randint(80, 85)
                enemy.weapon[2] = max_durability - 5
                enemy.weapon[3] = max_durability
            else:
                max_durability = random.randint(70, 80)
                enemy.weapon[2] = max_durability - 10
                enemy.weapon[3] = max_durability
        # 3. Противник ветеран
        elif self.enemy_generate_info[1] == "3. Противник ветеран":
            if self.enemy_generate_info[2] == "4. Богат":
                max_durability = random.randint(85, 90)
                enemy.weapon[2] = max_durability - 2
                enemy.weapon[3] = max_durability
            elif self.enemy_generate_info[2] == "3. В достатке":
                max_durability = random.randint(80, 85)
                enemy.weapon[2] = max_durability - 3
                enemy.weapon[3] = max_durability
            elif self.enemy_generate_info[2] == "2. Средний класс":
                max_durability = random.randint(75, 80)
                enemy.weapon[2] = max_durability - 5
                enemy.weapon[3] = max_durability
            else:
                max_durability = random.randint(65, 75)
                enemy.weapon[2] = max_durability - 10
                enemy.weapon[3] = max_durability
        # 4. Противник мастер
        elif self.enemy_generate_info[1] == "4. Противник мастер":
            if self.enemy_generate_info[2] == "4. Богат":
                max_durability = random.randint(80, 85)
                enemy.weapon[2] = max_durability - 2
                enemy.weapon[3] = max_durability
            elif self.enemy_generate_info[2] == "3. В достатке":
                max_durability = random.randint(75, 80)
                enemy.weapon[2] = max_durability - 3
                enemy.weapon[3] = max_durability
            elif self.enemy_generate_info[2] == "2. Средний класс":
                max_durability = random.randint(70, 75)
                enemy.weapon[2] = max_durability - 5
                enemy.weapon[3] = max_durability
            else:
                max_durability = random.randint(65, 70)
                enemy.weapon[2] = max_durability - 10
                enemy.weapon[3] = max_durability


    def generate_initiative(self, enemy):
        initiative = random.randint(1, 20)
        initiative += (int(enemy.skills[6].split(": ")[1]) - 10) // 2
        return initiative

    def generate_mobility_debuff(self, enemy):
        debuff = 0
        debuff += fullArmorDict.get(enemy.armor[0])[8]
        debuff += fullHelmetDict.get(enemy.helmet[0])[8]
        agil_buff = 0
        agility = int(enemy.skills[2].split(": ")[1])
        if agility <= 5:
            agil_buff = 2
        elif 6 <= agility <= 9:
            agil_buff = 1
        elif 15 <= agility <= 18:
            agil_buff = -1
        elif 19 <= agility <= 20:
            agil_buff = -2
        debuff += agil_buff
        return debuff

    def generate_grenades(self):
        # 1. Противник новичок
        if self.enemy_generate_info[1] == "1. Противник новичок":
            if self.enemy_generate_info[2] in ["3. В достатке", "4. Богат"]:
                if self.enemy_generate_info[2] == "4. Богат":
                    return new_random.choice(grenadeTier1Plus)
                else:
                    return new_random.choice(grenadeTier1 + grenadeTier1Plus)
            else:
                return new_random.choice(grenadeTier1)
        # 2. Противник опытный
        if self.enemy_generate_info[1] == "2. Противник опытный":
            if self.enemy_generate_info[2] in ["3. В достатке", "4. Богат"]:
                return new_random.choice(grenadeTier2)
            elif self.enemy_generate_info[2] == "2. Средний класс":
                return new_random.choice(grenadeTier1Plus + grenadeTier2)
            else:
                return new_random.choice(grenadeTier1Plus)
        # 3. Противник ветеран
        if self.enemy_generate_info[1] == "3. Противник ветеран":
            if self.enemy_generate_info[2] in ["3. В достатке", "4. Богат"]:
                return new_random.choice(grenadeTier3)
            elif self.enemy_generate_info[2] == "2. Средний класс":
                return new_random.choice(grenadeTier2Plus + grenadeTier3)
            else:
                return new_random.choice(grenadeTier2Plus + grenadeTier2)
        # 4. Противник мастер
        if self.enemy_generate_info[1] == "4. Противник мастер":
            if self.enemy_generate_info[2] == "4. Богат":
                if new_random.randint(5, 100) == 100:
                    return new_random.choice(grenadeTierS)
                else:
                    return new_random.choice(grenadeTier3Plus + grenadeTier3)
            elif self.enemy_generate_info[2] == "3. В достатке":
                return new_random.choice(grenadeTier3)
            elif self.enemy_generate_info[2] == "2. Средний класс":
                return new_random.choice(grenadeTier3 + grenadeTier2Plus)
            else:
                return new_random.choice(grenadeTier2Plus)

        return new_random.choice(grenadeTier1)

    def generate_skills(self):
        # 1. Противник новичок
        if self.enemy_generate_info[1] == "1. Противник новичок":
            enemy_skills = ["Стрелковые навыки: 5", "Сила: 8", "Ловкость: 8", "Воля: 8", "Ближний бой: 5",
                            "Внимательность: 8", "Тактика: 5", "Скрытность: 5", "Медицина: 5"]
            for i in range(15):
                chosen_index = enemy_skills.index(new_random.choice(enemy_skills))
                while int(enemy_skills[chosen_index].split(":")[1]) >= 12:
                    chosen_index = enemy_skills.index(new_random.choice(enemy_skills))
                enemy_skills[chosen_index] = enemy_skills[chosen_index].split(":")[0] + ": " + str(int(enemy_skills[chosen_index].split(":")[1]) + 1)
            return enemy_skills
        # 2. Противник опытный
        if self.enemy_generate_info[1] == "2. Противник опытный":
            enemy_skills = ["Стрелковые навыки: 8", "Сила: 8", "Ловкость: 8", "Воля: 8", "Ближний бой: 5",
                            "Внимательность: 8", "Тактика: 5", "Скрытность: 5", "Медицина: 5"]
            for i in range(22):
                chosen_index = enemy_skills.index(new_random.choice(enemy_skills))
                while int(enemy_skills[chosen_index].split(":")[1]) >= 14:
                    chosen_index = enemy_skills.index(new_random.choice(enemy_skills))
                enemy_skills[chosen_index] = enemy_skills[chosen_index].split(":")[0] + ": " + str(int(enemy_skills[chosen_index].split(":")[1]) + 1)
            return enemy_skills
        # 3. Противник ветеран
        if self.enemy_generate_info[1] == "3. Противник ветеран":
            enemy_skills = ["Стрелковые навыки: 12", "Сила: 8", "Ловкость: 8", "Воля: 8", "Ближний бой: 5",
                            "Внимательность: 8", "Тактика: 5", "Скрытность: 5", "Медицина: 5"]
            for i in range(28):
                chosen_index = enemy_skills.index(new_random.choice(enemy_skills))
                while int(enemy_skills[chosen_index].split(":")[1]) >= 16:
                    chosen_index = enemy_skills.index(new_random.choice(enemy_skills))
                enemy_skills[chosen_index] = enemy_skills[chosen_index].split(":")[0] + ": " + str(int(enemy_skills[chosen_index].split(":")[1]) + 1)
            return enemy_skills
        # 4. Противник мастер
        if self.enemy_generate_info[1] == "4. Противник мастер":
            enemy_skills = ["Стрелковые навыки: 14", "Сила: 8", "Ловкость: 8", "Воля: 8", "Ближний бой: 5",
                            "Внимательность: 8", "Тактика: 5", "Скрытность: 5", "Медицина: 5"]
            for i in range(36):
                chosen_index = enemy_skills.index(new_random.choice(enemy_skills))
                while int(enemy_skills[chosen_index].split(":")[1]) >= 18:
                    chosen_index = enemy_skills.index(new_random.choice(enemy_skills))
                enemy_skills[chosen_index] = enemy_skills[chosen_index].split(":")[0] + ": " + str(int(enemy_skills[chosen_index].split(":")[1]) + 1)
            return enemy_skills

        return ["Стрелковые навыки: 10", "Сила: 10", "Ловкость: 10", "Воля: 10", "Ближний бой: 10", "Внимательность: 10", "Тактика: 10", "Скрытность: 10", "Медицина: 10"]

    def generate_helmet(self, enemy):
        # Проверка на встроенный шлем
        if enemy.armor[0] in ["Костюм Химзащиты", "Костюм Химзащиты АНОМ", "Костюм Химзащиты Капельница",
                              "Костюм Химзащиты РАД", "Комбинезон Купол", "Комбинезон Купол Аном2",
                              "Комбинезон Купол ФИЗ", "Комбинезон Купол-М", "Комбинезон Купол-М ФИЗ",
                              "Комбинезон Купол-М АНОМ", "Комбинезон ГРОБ", "Комбинезон ГРОБ ФИЗ", "Экзоскелет",
                              "Экзоскелет ФИЗ", "Экзоскелет Оборона2"]:
            if enemy.armor[0] in ["Костюм Химзащиты", "Костюм Химзащиты АНОМ", "Костюм Химзащиты Капельница",
                              "Костюм Химзащиты РАД"]:
                return "Шлем Костюма Химзащиты"
            elif enemy.armor[0] in ["Комбинезон Купол", "Комбинезон Купол Аном2", "Комбинезон Купол ФИЗ"]:
                return "Шлем Купол"
            elif enemy.armor[0] in ["Комбинезон Купол-М", "Комбинезон Купол-М ФИЗ", "Комбинезон Купол-М АНОМ"]:
                return "Шлем Купол-М"
            elif enemy.armor[0] in ["Комбинезон ГРОБ", "Комбинезон ГРОБ ФИЗ"]:
                return "Шлем ГРОБ"
            else:
                return "Шлем экзоскелета"

        # 1. Противник новичок
        if self.enemy_generate_info[1] == "1. Противник новичок":
            if self.enemy_generate_info[2] in ["3. В достатке", "4. Богат"]:
                if self.enemy_generate_info[2] == "4. Богат":
                    return new_random.choice(helmetTier1Plus)
                else:
                    return new_random.choice(helmetTier1 + helmetTier1Plus)
            else:
                return new_random.choice(helmetTier1)
        # 2. Противник опытный
        if self.enemy_generate_info[1] == "2. Противник опытный":
            if self.enemy_generate_info[2] in ["3. В достатке", "4. Богат"]:
                return new_random.choice(helmetTier2)
            elif self.enemy_generate_info[2] == "2. Средний класс":
                return new_random.choice(helmetTier1Plus + helmetTier2)
            else:
                return new_random.choice(helmetTier1Plus)
        # 3. Противник ветеран
        if self.enemy_generate_info[1] == "3. Противник ветеран":
            if self.enemy_generate_info[2] in ["3. В достатке", "4. Богат"]:
                return new_random.choice(helmetTier3)
            elif self.enemy_generate_info[2] == "2. Средний класс":
                return new_random.choice(helmetTier2Plus + helmetTier3)
            else:
                return new_random.choice(helmetTier2Plus + helmetTier2)
        # 4. Противник мастер
        if self.enemy_generate_info[1] == "4. Противник мастер":
            if self.enemy_generate_info[2] == "4. Богат":
                if new_random.randint(5, 100) == 100:
                    return new_random.choice(helmetTierS)
                else:
                    return new_random.choice(helmetTier3Plus + helmetTier3)
            elif self.enemy_generate_info[2] == "3. В достатке":
                return new_random.choice(helmetTier3)
            elif self.enemy_generate_info[2] == "2. Средний класс":
                return new_random.choice(helmetTier3 + helmetTier2Plus)
            else:
                return new_random.choice(helmetTier2Plus)

        return new_random.choice(helmetTier1)

    def generate_armor(self):
        # 1. Противник новичок
        if self.enemy_generate_info[1] == "1. Противник новичок":
            if self.enemy_generate_info[2] in ["3. В достатке", "4. Богат"]:
                if self.enemy_generate_info[2] == "4. Богат":
                    return new_random.choice(armorTier1Plus)
                else:
                    return new_random.choice(armorTier1 + armorTier1Plus)
            else:
                return new_random.choice(armorTier1)
        # 2. Противник опытный
        if self.enemy_generate_info[1] == "2. Противник опытный":
            if self.enemy_generate_info[2] in ["3. В достатке", "4. Богат"]:
                return new_random.choice(armorTier2)
            elif self.enemy_generate_info[2] == "2. Средний класс":
                return new_random.choice(armorTier1Plus + armorTier2)
            else:
                return new_random.choice(armorTier1Plus)
        # 3. Противник ветеран
        if self.enemy_generate_info[1] == "3. Противник ветеран":
            if self.enemy_generate_info[2] in ["3. В достатке", "4. Богат"]:
                return new_random.choice(armorTier3)
            elif self.enemy_generate_info[2] == "2. Средний класс":
                return new_random.choice(armorTier2Plus + armorTier3)
            else:
                return new_random.choice(armorTier2Plus + armorTier2)
        # 4. Противник мастер
        if self.enemy_generate_info[1] == "4. Противник мастер":
            if self.enemy_generate_info[2] == "4. Богат":
                if new_random.randint(5, 100) == 100:
                    return new_random.choice(armorTierS)
                else:
                    return new_random.choice(armorTier3Plus + armorTier3)
            elif self.enemy_generate_info[2] == "3. В достатке":
                return new_random.choice(armorTier3)
            elif self.enemy_generate_info[2] == "2. Средний класс":
                return new_random.choice(armorTier3 + armorTier2Plus)
            else:
                return new_random.choice(armorTier2Plus)

        return new_random.choice(armorTier1)

    def generate_weapon(self):
        # 1. Противник новичок
        if self.enemy_generate_info[1] == "1. Противник новичок":
            if self.enemy_generate_info[2] in ["3. В достатке", "4. Богат"]:
                if self.enemy_generate_info[2] == "4. Богат":
                    return weaponDict.get(new_random.choice(weaponsTier1Plus))
                else:
                    return weaponDict.get(new_random.choice(weaponsTier1 + weaponsTier1Plus))
            else:
                return weaponDict.get(new_random.choice(weaponsTier1))
        # 2. Противник опытный
        if self.enemy_generate_info[1] == "2. Противник опытный":
            if self.enemy_generate_info[2] in ["3. В достатке", "4. Богат"]:
                return weaponDict.get(new_random.choice(weaponsTier2))
            elif self.enemy_generate_info[2] == "2. Средний класс":
                return weaponDict.get(new_random.choice(weaponsTier1Plus + weaponsTier2))
            else:
                return weaponDict.get(new_random.choice(weaponsTier1Plus))
        # 3. Противник ветеран
        if self.enemy_generate_info[1] == "3. Противник ветеран":
            if self.enemy_generate_info[2] in ["3. В достатке", "4. Богат"]:
                return weaponDict.get(new_random.choice(weaponsTier3))
            elif self.enemy_generate_info[2] == "2. Средний класс":
                return weaponDict.get(new_random.choice(weaponsTier2Plus + weaponsTier3))
            else:
                return weaponDict.get(new_random.choice(weaponsTier2Plus + weaponsTier2))
        # 4. Противник мастер
        if self.enemy_generate_info[1] == "4. Противник мастер":
            if self.enemy_generate_info[2] == "4. Богат":
                if new_random.randint(1, 100) == 100:
                    return weaponDict.get(new_random.choice(weaponsTierS))
                else:
                    return weaponDict.get(new_random.choice(weaponsTier3Plus + weaponsTier3))
            elif self.enemy_generate_info[2] == "3. В достатке":
                return weaponDict.get(new_random.choice(weaponsTier3))
            elif self.enemy_generate_info[2] == "2. Средний класс":
                return weaponDict.get(new_random.choice(weaponsTier3 + weaponsTier2Plus))
            else:
                return weaponDict.get(new_random.choice(weaponsTier2Plus))

        return weaponDict.get(new_random.choice(weaponsTier1))

    def generate_enemy_loot(self):
        current_enemy_loot = EnemyLoot(self.new_enemy, self.enemy_generate_info)
        return current_enemy_loot